var s2_lang = {
	load				: 'Загрузка...',
	load_tree			: 'Загружается структура сайта...',
	new_page			: 'Новая страница',

	install_extension	: 'Расширение «%s» будет установлено.',
	install_message		: 'Внимательно прочитайте перед установкой:\n\n%s\n\n',
	install_title		: 'Установить расширение?',
	install_confirm		: 'Установить',

	delete_extension	: 'Расширение «%s» будет удалено безвозвратно.',
	uninstall_message	: 'Внимательно прочитайте перед удалением:\n\n%s\n\nПродолжить удаление?',
	uninstall_title		: 'Удалить расширение?',
	uninstall_confirm	: 'Удалить навсегда',
	delete_title		: 'Удалить безвозвратно?',
	delete_confirm		: 'Удалить навсегда',
	cancel				: 'Отменить',
	cannot_undo			: 'Это действие нельзя отменить.',
	extension_action_failed: 'Не удалось изменить расширение. Обновите страницу и попробуйте ещё раз.',

	unknown_error		: 'Неизвестная ошибка',
	server_response		: 'Что-то не сработало. Сообщите администраторам или разработчикам о том, в каких условиях возникает ошибка, и приложите ответ сервера:',

	unsaved_exit		: 'Вы не сохранили страницу, которую редактировали ранее. Вы действительно хотите покинуть панель управления? Помните, что при этом потеряется несохраненный вариант старой страницы.',

	recovered_text		: 'Восстановленный текст',
	recovered_text_alert: 'Не сохраненный ранее текст восстановлен.',
	recovered_text_info : 'Не сохраненный в предыдущий раз текст был восстановлен. Вы можете скопировать нужные фрагменты и вставить их в редактор.',
	recovered_open		: 'Открыть в новом окне',

	delete_file			: 'Будет удалено безвозвратно: %s. Это действие нельзя отменить.',
	delete_item			: '«%s» и все дочерние элементы будут удалены безвозвратно. Это действие нельзя отменить.',

	multiple_files		: 'Несколько файлов',
	create_subfolder	: 'Создать подпапку',
	delete_folder		: 'Удалить папку',

	file				: 'Файл: ',
	value				: 'Объем: ',
	size				: 'Размер: ',
	color				: 'Глубина цвета: ',
	insert				: '← Вставить',
	retina_help			: 'Высокое разрешение',
	reduction			: ' &rarr; ',

	files_too_big		: 'Следующие файлы не загружались, так как их размер больше разрешенного на сервере (%s):'
};
